; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph0 - mode
	image1 - mode
	GroundStation1 - direction
	GroundStation4 - direction
	Star7 - direction
	Star8 - direction
	Star10 - direction
	GroundStation14 - direction
	GroundStation5 - direction
	Star12 - direction
	Star6 - direction
	Star13 - direction
	GroundStation9 - direction
	Star11 - direction
	GroundStation3 - direction
	Star0 - direction
	Star2 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star12)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument1 image1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star13)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 Star13)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
)
(:goal (and
	(pointing satellite0 GroundStation9)
	(have_image Planet15 image1)
	(have_image Planet16 image1)
	(have_image Phenomenon17 image1)
	(have_image Planet18 image1)
	(have_image Planet19 image1)
))

)

; plan
1. (turn_to satellite1 star0 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star0)
   goals met: 0 of 6
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 6
4. (turn_to satellite1 planet15 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet15)
   goals met: 0 of 6
5. (take_image satellite1 planet15 instrument1 image1)
   added: (have_image planet15 image1)
   goals met: 1 of 6
6. (turn_to satellite1 phenomenon17 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 phenomenon17)
   goals met: 1 of 6
7. (turn_to satellite0 groundstation9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation9)
   goals met: 2 of 6
8. (take_image satellite1 phenomenon17 instrument1 image1)
   added: (have_image phenomenon17 image1)
   goals met: 3 of 6
9. (turn_to satellite1 planet16 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 planet16)
   goals met: 3 of 6
10. (take_image satellite1 planet16 instrument1 image1)
   added: (have_image planet16 image1)
   goals met: 4 of 6
11. (turn_to satellite1 planet18 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet18)
   goals met: 4 of 6
12. (take_image satellite1 planet18 instrument1 image1)
   added: (have_image planet18 image1)
   goals met: 5 of 6
13. (turn_to satellite1 planet19 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 planet19)
   goals met: 5 of 6
14. (take_image satellite1 planet19 instrument1 image1)
   added: (have_image planet19 image1)
   goals met: 6 of 6
